DataProcessors/ххх_СигаретныйЦенник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ххх_СигаретныйЦенник</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТабличныйДокумент</Name>
					<Type>
						<v8:Type>mxl:SpreadsheetDocument</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блоки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Масштаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АналитикаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикаХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ххх_СигаретныйЦенник/Ext/ObjectModule.bsl
Функция сформировать()экспорт
	ТабличныйДокумент.Очистить();
	
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Печать_Сиграетного_Ценника";
	
	//ЭтотОбъект.Масштаб=ТабличныйДокумент.МасштабПечати;
	Запрос=Новый запрос;
	запрос.УстановитьПараметр("Цена",Справочники.ххх_Справочник.РозничнаяЦена.Значение);
	запрос.УстановитьПараметр("ГруппаСигареты",Справочники.ххх_Справочник.ГруппаСигареты.Значение);
	запрос.УстановитьПараметр("ГруппаСигаретыБлоки",Справочники.ххх_Справочник.ГруппаСигаретыБлоки.Значение);
	Если Блоки Тогда
		Запрос.Текст="ВЫБРАТЬ
		             |	ТоварыНаСкладахОстатки.Номенклатура.ххх_НаименованиеЦенник КАК НаименованиеЦенник,
		             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		             |ИЗ
		             |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура В ИЕРАРХИИ (&ГруппаСигаретыБлоки)) КАК ТоварыНаСкладахОстатки
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		             |				,
		             |				ВидЦены = &Цена
		             |					И Номенклатура В ИЕРАРХИИ (&ГруппаСигаретыБлоки)) КАК ЦеныНоменклатурыСрезПоследних
		             |		ПО ТоварыНаСкладахОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		             |ГДЕ
		             |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	НаименованиеЦенник";
		Макет=ЭтотОбъект.ПолучитьМакет("МакетБлоки");

	иначе
		мас=Новый массив;
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","4898"));
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","5902"));
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","90"));
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","2200"));
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","6055"));
		мас.Добавить(Справочники.ххх_Справочник.ГруппаСигаретыБлоки.Значение);

		запрос.УстановитьПараметр("ИсключенныеПапки",мас);
		Запрос.Текст="ВЫБРАТЬ
		             |	ТоварыНаСкладахОстатки.Номенклатура.ххх_НаименованиеЦенник КАК НаименованиеЦенник,
		             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		             |ИЗ
		             |	РегистрНакопления.ТоварыНаСкладах.Остатки(
		             |			,
		             |			Номенклатура В ИЕРАРХИИ (&ГруппаСигареты)
		             |				И НЕ Номенклатура В ИЕРАРХИИ (&ИсключенныеПапки)) КАК ТоварыНаСкладахОстатки
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		             |				,
		             |				ВидЦены = &Цена
		             |					И Номенклатура В ИЕРАРХИИ (&ГруппаСигареты)
		             |					И НЕ Номенклатура В ИЕРАРХИИ (&ИсключенныеПапки)) КАК ЦеныНоменклатурыСрезПоследних
		             |		ПО ТоварыНаСкладахОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		             |ГДЕ
		             |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	НаименованиеЦенник";
		Макет=ЭтотОбъект.ПолучитьМакет("МакетСигареты");
	КонецЕсли;
	//Выгрузка=запрос.Выполнить().Выгрузить();
	Выборка=Запрос.Выполнить().Выбрать();
	//Для каждого стр из Выгрузка Цикл
	//	стр.НастройкиКомпоновкиДанных=ххх_Сервер.ОписаниеПараметровНастройки(стр.скд, стр.НастройкиКомпоновкиДанных);
	//КонецЦикла
	
	
	Шапка=макет.ПолучитьОбласть("Шапка");
	Шапка.параметры.дата=текущаяДата();
	Шапка.параметры.Организация=Организация;
	ТабличныйДокумент.Вывести(Шапка);

	ШапкаТаблицы=макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ШапкаТаблицы);

	й=1;;
	
	Пока Выборка.Следующий() Цикл
		
		
		
		Строка=макет.ПолучитьОбласть("Строка");
		Строка.параметры.Номер=й;
		Строка.параметры.Наименование=Выборка.НаименованиеЦенник;
		Строка.параметры.Цена=Выборка.Цена;
		
		Если не ТабличныйДокумент.ПроверитьВывод(Строка) ТОгда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(Шапка);
		КонецЕСли;
		
		ТабличныйДокумент.Вывести(Строка);
		
		й=й+1;
	КонецЦикла;
	
	
	//возврат ТабличныйДокумент;
КонецФункции
